app/controllers/novo_resultados_controller.rb

SELECT * FROM `novo_resultados`
---
  def index
    @novo_resultados = NovoResultado.all

SELECT * FROM `novo_resultados` WHERE (`novo_resultados`.`id` = 1)
---
  def show
    @novo_resultado = NovoResultado.find(params[:id])

SELECT * FROM `novo_resultados` WHERE (`novo_resultados`.`id` = 1)
---
  def edit
    @novo_resultado = NovoResultado.find(params[:id])

INSERT INTO `novo_resultados` (`pontos`, `created_at`, `etapa`, `updated_at`, `posicao`, `cidade`, `equipe`) VALUES(10, '2010-01-06 22:44:55', 1, '2010-01-06 22:44:55', 1, 'sp', 'test')
---
  def create
    @novo_resultado = NovoResultado.new(params[:novo_resultado])

    respond_to do |format|
      if @novo_resultado.save