app/controllers/resultados_controller.rb

SELECT * FROM `resultados` WHERE (cidade='piracicaba') ORDER BY etapa, posicao, equipe, pontos
---
  def filter
    @resultados=Resultado.find(:all, :conditions => "#{params[:criterio]}='#{params[:id]}'", :order => "etapa, posicao, equipe, pontos")